test/request-response-samples/SendCDATA__cdata_is_handled_correctly/request.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"  xmlns:tns="http://example.com/testservice.wsdl" xmlns:xsd1="http://example.com/testservice.xsd"><soap:Body><xsd1:TestMessage xmlns:xsd1="http://example.com/testservice.xsd"><TestMessage><message><![CDATA[Hello World! & Hello Me!]]></message></TestMessage></xsd1:TestMessage></soap:Body></soap:Envelope>